burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_cmp.c
    if(CMP0 == cmp_periph) {
        if(CMP_INT_FLAG_COMPARE == flag) {
            /* get the corresponding flag bit status */
            flagstatus = CMP_STAT & CMP_STAT_CMP0IF;
            /* get the interrupt enable bit status */
            intstatus = CMP0_CS & CMP_CS_CMPXINTEN;
        } else {
        }
    } else if(CMP1 == cmp_periph) {
        if(CMP_INT_FLAG_COMPARE == flag) {
            /* get the corresponding flag bit status */
            flagstatus = CMP_STAT & CMP_STAT_CMP1IF;
            /* get the interrupt enable bit status */
            intstatus = CMP1_CS & CMP_CS_CMPXINTEN;
        } else {
        }
    } else if(CMP2 == cmp_periph) {
        if(CMP_INT_FLAG_COMPARE == flag) {
            /* get the corresponding flag bit status */
            flagstatus = CMP_STAT & CMP_STAT_CMP2IF;
            /* get the interrupt enable bit status */
            intstatus = CMP2_CS & CMP_CS_CMPXINTEN;
        } else {
        }
    } else if(CMP3 == cmp_periph) {
        if(CMP_INT_FLAG_COMPARE == flag) {
            /* get the corresponding flag bit status */
            flagstatus = CMP_STAT & CMP_STAT_CMP3IF;
            /* get the interrupt enable bit status */
            intstatus = CMP3_CS & CMP_CS_CMPXINTEN;
        } else {
        }
    } else {
    }

    if((0U != flagstatus) && (0U != intstatus)) {
        retval = SET;
    } else {
        retval = RESET;
    }

    return retval;
}

/*!
    \brief      clear CMP interrupt flag (API_ID(0x0013U))
    \param[in]  cmp_periph
      \arg        CMP0: comparator 0
      \arg        CMP1: comparator 1
      \arg        CMP2: comparator 2
      \arg        CMP3: comparator 3
    \param[in]  flag: CMP interrupt flags
      \arg        CMP_INT_FLAG_COMPARE: CMP compare interrupt flag
    \param[out] none
    \retval     none
*/
void cmp_interrupt_flag_clear(cmp_enum cmp_periph, uint32_t flag)
{
    /* clear CMP interrupt flag */
    if(CMP0 == cmp_periph) {
        if(CMP_INT_FLAG_COMPARE == flag) {
            CMP_IFC |= (uint32_t)CMP_IFC_CMP0IC;
        } else {
        }
    } else if(CMP1 == cmp_periph) {
        if(CMP_INT_FLAG_COMPARE == flag) {
            CMP_IFC |= (uint32_t)CMP_IFC_CMP1IC;
        } else {
        }
    } else if(CMP2 == cmp_periph) {
        if(CMP_INT_FLAG_COMPARE == flag) {
            CMP_IFC |= (uint32_t)CMP_IFC_CMP2IC;
        } else {
        }
    } else if(CMP3 == cmp_periph) {
        if(CMP_INT_FLAG_COMPARE == flag) {
            CMP_IFC |= (uint32_t)CMP_IFC_CMP3IC;
        } else {
        }
    } else {
    }
}
